---
kind: method
id: M:Autodesk.Revit.DB.CurtainGrid.GetMullionIds
source: html/7988417f-94dd-89b8-e266-038353537745.htm
---
# Autodesk.Revit.DB.CurtainGrid.GetMullionIds Method

Gets all ElementIds of the mullions of the curtain grid.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetMullionIds()
```

## Returns
The mullion ElementIds

## Remarks
ElementIds are of Mullion Elements.